Pizza v1/Domino/app/controllers/dominos_controller.rb

SELECT * FROM "dominos"
---
  def index
    @dominos = Domino.all

SELECT * FROM "dominos" WHERE ("dominos"."id" = 1)
---
  def show
    @domino = Domino.find(params[:id])

SELECT * FROM "dominos" WHERE ("dominos"."id" = 2)
---
  def edit
    @domino = Domino.find(params[:id])

INSERT INTO "dominos" ("updated_at", "Company_name", "postcode", "First_name", "State", "Phone_no", "Last_name", "password", "Age", "Address", "created_at") VALUES('2009-09-15 09:32:29', 'kjk[o', '59900', 'ayhe;', 'kjopp', 3843287, 'WKALSK', 'kJadjlqs', 22, 'okjpo[pp', '2009-09-15 09:32:29')
---
  def create
    @domino = Domino.new(params[:domino])

    respond_to do |format|
      if @domino.save

SELECT * FROM "dominos" WHERE ("dominos"."id" = 2)
UPDATE "dominos" SET "password" = '55555', "Last_name" = 'Alnuaimi', "updated_at" = '2009-09-16 04:56:26' WHERE "id" = 2
---
  def update
    @domino = Domino.find(params[:id])

    respond_to do |format|
      if @domino.update_attributes(params[:domino])

SELECT * FROM "dominos" WHERE ("dominos"."id" = 1)
DELETE FROM "dominos" WHERE "id" = 1
---
  def destroy
    @domino = Domino.find(params[:id])
    @domino.destroy